images_folders = {
    "Зодиакальный": "zodiac",
    "Китайский": "chinese"
}

signs = {
    "Зодиакальный": {
        "Овен": ("aries", "0321", "0420"),
        "Телец": ("taurus", "0421", "0520"),
        "Близнецы": ("gemini", "0521", "0620"),
        "Рак": ("cancer", "0621", "0722"),
        "Лев": ("lion", "0723", "0822"),
        "Дева": ("virgo", "0823", "0922"),
        "Весы": ("libra", "0923", "1022"),
        "Скорпион": ("scorpio", "1023", "1121"),
        "Стрелец": ("sagittarius", "1122", "1221"),
        "Козерог": ("capricorn", "1222", "0119"),
        "Водолей": ("aquarius", "0120", "0218"),
        "Рыбы": ("pisces", "0219", "0320")
    },
    "Китайский": {
        "Крыса": ("rat", (1900, 1912, 1924, 1936, 1948, 1960, 1972, 1984, 1996, 2008)),
        "Вол": ("ox", (1901, 1913, 1925, 1937, 1949, 1961, 1973, 1985, 1997, 2009)),
        "Тигр": ("tiger", (1902, 1914, 1926, 1938, 1950, 1962, 1974, 1986, 1998, 2010)),
        "Кот": ("hare", (1903, 1915, 1927, 1939, 1951, 1963, 1975, 1987, 1999, 2011)),
        "Дракон": ("dragon", (1904, 1916, 1928, 1940, 1952, 1964, 1976, 1988, 2000, 2012)),
        "Змея": ("snake", (1905, 1917, 1929, 1941, 1953, 1965, 1977, 1989, 2001, 2013)),
        "Лошадь": ("horse", (1906, 1918, 1930, 1942, 1954, 1966, 1978, 1990, 2002, 2014)),
        "Коза": ("goat", (1907, 1919, 1931, 1943, 1955, 1967, 1979, 1991, 2003, 2015)),
        "Обезьяна": ("monk", (1908, 1920, 1932, 1944, 1956, 1968, 1980, 1992, 2004, 2016)),
        "Петух": ("cock", (1909, 1921, 1933, 1945, 1957, 1969, 1981, 1993, 2005, 2017)),
        "Собака": ("dog", (1910, 1922, 1934, 1946, 1958, 1970, 1982, 1994, 2006, 2018)),
        "Свинья": ("pig", (1911, 1923, 1935, 1947, 1959, 1971, 1983, 1995, 2007, 2019))
    }
}

sources = {
    "orakul.com": {
        "url": "http://orakul.com/horoscope/{horoscope}/general/{sign}/today.html",
        "horoscopes": {
            "Зодиакальный": "astrologic",
            "Китайский": "chinese",
            # "Японский": "japanese",
            # "Древних Майя": "mayan"
        },
        "Зодиакальный": {
            "Овен": "aries",
            "Телец": "taurus",
            "Близнецы": "gemini",
            "Рак": "cancer",
            "Лев": "lion",
            "Дева": "virgo",
            "Весы": "libra",
            "Скорпион": "scorpio",
            "Стрелец": "sagittarius",
            "Козерог": "capricorn",
            "Водолей": "aquarius",
            "Рыбы": "pisces"
        },
        "Китайский": {
            "Крыса": "rat",
            "Вол": "ox",
            "Тигр": "tiger",
            "Кот": "hare",
            "Дракон": "dragon",
            "Змея": "snake",
            "Лошадь": "horse",
            "Коза": "goat",
            "Обезьяна": "monk",
            "Петух": "cock",
            "Собака": "dog",
            "Свинья": "pig",
        },
        # "japanese": {},
        # "mayan": {}
    },
    "horo.mail.ru": {
        "zodiac_url": "https://horo.mail.ru/prediction/{sign}/today/",
        "chinese_url": "https://horo.mail.ru/horoscope/{horoscope}/{sign}/",
        "horoscopes": {
            "Зодиакальный": "zodiac",
            "Китайский": "chinese",
            # "Японский": "japanese",
            # "Зороастрийский": "zoro"
        },
        "Зодиакальный": {
            "Овен": "aries",
            "Телец": "taurus",
            "Близнецы": "gemini",
            "Рак": "cancer",
            "Лев": "leo",
            "Дева": "virgo",
            "Весы": "libra",
            "Скорпион": "scorpio",
            "Стрелец": "sagittarius",
            "Козерог": "capricorn",
            "Водолей": "aquarius",
            "Рыбы": "pisces"
        },
        "Китайский": {
            "Крыса": "222",
            "Вол": "223",
            "Тигр": "224",
            "Кот": "225",
            "Дракон": "226",
            "Змея": "227",
            "Лошадь": "228",
            "Коза": "229",
            "Обезьяна": "230",
            "Петух": "231",
            "Собака": "232",
            "Свинья": "233",
        },
        # "japanese": {},
        # "zoro": {}
    }
}
